ETL/Catalogs/ЗначенияЭталонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ЗначенияЭталонов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.ТипыЭталонов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭталонПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.РеквизитыЭталонов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/ChartsOfCharacteristicTypes/ТипыЭталонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ТипыЭталонов</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ПланСчетов</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыЗатрат</v8:Type>
				<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияЭталонов</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.INDПрочиеПоказатели</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКредиторов</v8:Type>
				<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
				<v8:Type>cfg:CatalogRef.КаналыПродаж</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяТаблицыSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПредставление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляSQL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоРеквизиту</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отображать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

ETL/Catalogs/ЗначенияЭталонов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
// Код процедур и функций

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() и Параметры.Свойство("Владелец") Тогда
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;   	
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		
		Если Параметры.Ключ.Пустая() Тогда
			ЗаполнитьТаблицуРеквизитовПоТипу(Объект.Владелец);			
		Иначе
			ЗаполнитьТаблицуРеквизитовОбъекта();
	    КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

 &НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.Реквизиты.Очистить();
	
	Для каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаРеквизитов Цикл
		
		НоваяСтрока = Объект.Реквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Реквизиты.Очистить();
	
	Для каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаРеквизитов Цикл
		
		НоваяСтрока = ТекущийОбъект.Реквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;   

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций   

  &НаКлиенте
  Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	  Если Объект.Владелец <> ВыбранноеЗначение Тогда
		  
		  Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			  
			  Режим = РежимДиалогаВопрос.ДаНет;
			  Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
			  ПоказатьВопрос(Оповещение, "Изменился тип Владельца. Таблица реквизитов будет перезаполнена. Продолжить выполнение операции?", Режим, 0);
			  
		  Иначе
			  ЗаполнитьТаблицуРеквизитовПоТипу(ВыбранноеЗначение); 
			  
		  КонецЕсли;  		  
		  
	  КонецЕсли;       
	  
  КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРеквизитов
// Код процедур и функций      

&НаКлиенте
Процедура ТаблицаРеквизитовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовОбъекта() 
	
	  Запрос = Новый Запрос;
	
	  Запрос.УстановитьПараметр("Тип", Объект.Владелец); 
	  Запрос.УстановитьПараметр("Ссылка", Параметры.Ключ);

	  
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ЗначенияЭталоновРеквизиты.Реквизит КАК Реквизит,
	                 |	ЗначенияЭталоновРеквизиты.Значение КАК Значение,
	                 |	ЗначенияЭталоновРеквизиты.Ссылка.Владелец КАК Владелец
	                 |ПОМЕСТИТЬ ВТРеквизиты
	                 |ИЗ
	                 |	Справочник.ЗначенияЭталонов.Реквизиты КАК ЗначенияЭталоновРеквизиты
	                 |ГДЕ
	                 |	ЗначенияЭталоновРеквизиты.Ссылка = &Ссылка
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ТипыЭталоновРеквизиты.Реквизит КАК Реквизит,
	                 |	ВТРеквизиты.Значение КАК Значение
	                 |ИЗ
	                 |	ПланВидовХарактеристик.ТипыЭталонов.Реквизиты КАК ТипыЭталоновРеквизиты
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРеквизиты КАК ВТРеквизиты
	                 |		ПО (ВТРеквизиты.Владелец = ТипыЭталоновРеквизиты.Ссылка)
	                 |			И (ВТРеквизиты.Реквизит = ТипыЭталоновРеквизиты.Реквизит)
	                 |ГДЕ
	                 |	ТипыЭталоновРеквизиты.Ссылка = &Тип"; 
	  
	  
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	  Пока Выборка.Следующий() Цикл
		  
			СтрокаТЗ = ЭтотОбъект.ТаблицаРеквизитов.Добавить();	 
			СтрокаТЗ.Реквизит = Выборка.Реквизит;
			СтрокаТЗ.Значение = Выборка.Значение;
		  
	  КонецЦикла; 
	
	
  КонецПроцедуры 
  
&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовПоТипу(ТипЭталона) 
	
	  Запрос = Новый Запрос;
	
	  Запрос.УстановитьПараметр("Тип", ТипЭталона);
	  
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ТипыЭталоновРеквизиты.Реквизит КАК Реквизит
	                 |ИЗ
	                 |	ПланВидовХарактеристик.ТипыЭталонов.Реквизиты КАК ТипыЭталоновРеквизиты
	                 |ГДЕ
	                 |	ТипыЭталоновРеквизиты.Ссылка = &Тип"; 
	  
	  
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	 Пока Выборка.Следующий() Цикл
		  
			СтрокаТЗ = ЭтотОбъект.ТаблицаРеквизитов.Добавить();	 
			СтрокаТЗ.Реквизит = Выборка.Реквизит; 
				  
	  КонецЦикла; 
	
	
  КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьТаблицуРеквизитовПоТипу(Объект.Владелец);

КонецПроцедуры

#КонецОбласти
